УТ_для_edt/src/Catalogs/CRM_ИнтервалыВремениНаСайте/CRM_ИнтервалыВремениНаСайте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ИнтервалыВремениНаСайте</name>
  <predefined>
    <items>
      <name>Отказ</name>
      <description>0 сек (отказ)</description>
    </items>
    <items>
      <name>Уровень60_119</name>
      <description>1 минута</description>
    </items>
    <items>
      <name>Уровень1_9</name>
      <description>1-9 секунд</description>
    </items>
    <items>
      <name>УровеньМин10_19</name>
      <description>10-19 минут</description>
    </items>
    <items>
      <name>Уровень10_29</name>
      <description>10-29 секунд</description>
    </items>
    <items>
      <name>Уровень120_179</name>
      <description>2 минуты</description>
    </items>
    <items>
      <name>УровеньМин20_29</name>
      <description>20-29 минут</description>
    </items>
    <items>
      <name>Уровень180_239</name>
      <description>3 минуты</description>
    </items>
    <items>
      <name>УровеньМин30_59</name>
      <description>30-59 минут</description>
    </items>
    <items>
      <name>Уровень30_59</name>
      <description>30-59 секунд</description>
    </items>
    <items>
      <name>Уровень240_299</name>
      <description>4 минуты</description>
    </items>
    <items>
      <name>УровеньМин5_9</name>
      <description>5-9 минут</description>
    </items>
    <items>
      <name>УровеньЧас</name>
      <description>Более 60 мин</description>
    </items>
  </predefined>
  <attributes>
    <name>min</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>max</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ИнтервалыВремениНаСайте/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	Отказ = ПроверкаПоДаннымПредопределенный();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверкаПоДаннымПредопределенный()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &min >= CRM_ИнтервалыВремениНаСайте.min
		|				И &min <= CRM_ИнтервалыВремениНаСайте.max
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МинимальноеЧисло,
		|	ВЫБОР
		|		КОГДА &max >= CRM_ИнтервалыВремениНаСайте.min
		|				И &max <= CRM_ИнтервалыВремениНаСайте.max
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МаксимальноеЧисло
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.CRM_ИнтервалыВремениНаСайте КАК CRM_ИнтервалыВремениНаСайте
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.МинимальноеЧисло КАК МинимальноеЧисло,
		|	ВТ.МаксимальноеЧисло КАК МаксимальноеЧисло
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	(ВТ.МинимальноеЧисло
		|			ИЛИ ВТ.МаксимальноеЧисло)";
	
	Запрос.УстановитьПараметр("max", max);
	Запрос.УстановитьПараметр("min", min);
	
	РезультатЗапроса = Запрос.Выполнить().Пустой();
	
	Если НЕ РезультатЗапроса Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заданные числа пересекаются с другими показателями, необходимо изменить значения");
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
